select 
  sponsor,
  date,
  amount
from sponsors as s
join donations as d
on s.id = sponsors_id
order by s.id, date;

-- +-------------------+------------+------------+
-- | sponsor           | date       | amount     |
-- +-------------------+------------+------------+
-- | Детский паллиатив | 2008-07-13 |   34539.00 |
-- | Детский паллиатив | 2008-12-21 | 1996781.00 |
-- | Обнимая небо      | 2004-06-16 |  245080.00 |
-- ...............................................
-- | Перспективы       | 2012-05-12 | 1736411.00 |
-- | Перспективы       | 2018-09-15 |  127413.00 |
-- | Перспективы       | 2021-10-26 | 1870133.00 |
-- +-------------------+------------+------------+
-- 70 rows in set (0.0019 sec)


  select sponsor,
         department,
         amount
    from sponsors as s
    join donations
      on s.id = sponsors_id
    join departments as d
      on departments_id = d.id
order by s.id, d.id;

-- +-------------------+--------------------------------------+------------+
-- | sponsor           | department                           | amount     |
-- +-------------------+--------------------------------------+------------+
-- | Детский паллиатив | Неврологическое отделение            |   34539.00 |
-- | Детский паллиатив | Реанимация и интенсивная терапия     | 1996781.00 |
-- | Обнимая небо      | Неврологическое отделение            |  245080.00 |
-- .........................................................................
-- | Перспективы       | Отделение функциональной диагностики |   71189.00 |
-- | Перспективы       | Отделение функциональной диагностики | 1870133.00 |
-- | Перспективы       | Физиотерапевтическое отделение       |  127413.00 |
-- +-------------------+--------------------------------------+------------+
-- 70 rows in set (0.0024 sec)


  select department,
         -- amount,
         -- ward
         format(
           sum(amount) / pow(count(distinct ward), 2), 
           0
         ) as 'avg ward balance'
    from donations as dn
    join departments as dp
      on dn.departments_id = dp.id
    join wards as w
      on w.departments_id = dp.id
group by department
order by department;

-- +--------------------------------------+------------------+
-- | department                           | avg ward balance |
-- +--------------------------------------+------------------+
-- | Кардиологическое отделение           | 592,191          |
-- | Неврологическое отделение            | 1,853,102        |
-- | Отделение общей терапии              | 976,597          |
-- | Отделение функциональной диагностики | 3,508,318        |
-- | Реанимация и интенсивная терапия     | 3,766,929        |
-- | Токсикологическое отделение          | 992,472          |
-- | Физиотерапевтическое отделение       | 365,426          |
-- +--------------------------------------+------------------+
-- 7 rows in set (0.0024 sec)
