select *
  from specializations as s
  join specializations_doctors
    on s.id = specializations_id;

-- +----+----------------+--------------------+------------+
-- | id | specialization | specializations_id | doctors_id |
-- +----+----------------+--------------------+------------+
-- |  1 | Анестезиолог   |                  1 |         13 |
-- |  3 | Дерматолог     |                  3 |         30 |
-- |  3 | Дерматолог     |                  3 |         39 |
-- .........................................................
-- | 19 | Хирург         |                 19 |         59 |
-- | 20 | Эндокринолог   |                 20 |         39 |
-- | 20 | Эндокринолог   |                 20 |         57 |
-- +----+----------------+--------------------+------------+
-- 50 rows in set (0.0014 sec)


   select *
     from specializations as s 
left join specializations_doctors
       on s.id = specializations_id;

-- +----+-----------------+--------------------+------------+
-- | id | specialization  | specializations_id | doctors_id |
-- +----+-----------------+--------------------+------------+
-- |  1 | Анестезиолог    |                  1 |         13 |
-- |  2 | Гастроэнтеролог |               NULL |       NULL |
-- |  3 | Дерматолог      |                  3 |         30 |
-- ..........................................................
-- | 19 | Хирург          |                 19 |         59 |
-- | 20 | Эндокринолог    |                 20 |         39 |
-- | 20 | Эндокринолог    |                 20 |         57 |
-- +----+-----------------+--------------------+------------+
-- 53 rows in set (0.0008 sec)


    select *
      from specializations_doctors
right join specializations as s
        on s.id = specializations_id;

-- +--------------------+------------+----+-----------------+
-- | specializations_id | doctors_id | id | specialization  |
-- +--------------------+------------+----+-----------------+
-- |                  1 |         13 |  1 | Анестезиолог    |
-- |               NULL |       NULL |  2 | Гастроэнтеролог |
-- |                  3 |         30 |  3 | Дерматолог      |
-- ..........................................................
-- |                 19 |         59 | 19 | Хирург          |
-- |                 20 |         39 | 20 | Эндокринолог    |
-- |                 20 |         57 | 20 | Эндокринолог    |
-- +--------------------+------------+----+-----------------+
-- 53 rows in set (0.0010 sec)


   select specialization,
          count(doctors_id) as 'doctors'
     from specializations as s 
left join specializations_doctors
       on s.id = specializations_id
 group by specialization
 order by `doctors`;

-- +-------------------+---------+
-- | specialization    | doctors |
-- +-------------------+---------+
-- | Гастроэнтеролог   |       0 |
-- | Ревматолог        |       0 |
-- | Терапевт          |       0 |
-- | Анестезиолог      |       1 |
-- | Кардиолог         |       1 |
-- | Оториноларинголог |       1 |
-- | Дерматолог        |       2 |
-- | Иммунолог         |       2 |
-- | Онколог           |       2 |
-- | Ортопед           |       2 |
-- | Стоматолог        |       2 |
-- | Эндокринолог      |       2 |
-- | Нарколог          |       3 |
-- | Реаниматолог      |       3 |
-- | Травматолог       |       3 |
-- | Диетолог          |       4 |
-- | Уролог            |       4 |
-- | Невролог          |       5 |
-- | Хирург            |       5 |
-- | Офтальмолог       |       8 |
-- +-------------------+---------+
-- 20 rows in set (0.0017 sec)


