  select *
    from departments
    join wards
order by departments.id, 
         wards.id;

-- декартово произведение - сочетания каждой строки одной таблицы с каждой строкой другой таблицы
-- +----+--------------------------------+----+------+----------------+
-- | id | department                     | id | ward | departments_id |
-- +----+--------------------------------+----+------+----------------+
-- |  1 | Отделение общей терапии        |  1 | ОТ-1 |              1 |
-- |  1 | Отделение общей терапии        |  2 | ОТ-2 |              1 |
-- |  1 | Отделение общей терапии        |  3 | ОТ-3 |              1 |
-- |  1 | Отделение общей терапии        |  4 | ОТ-4 |              1 |
-- |  1 | Отделение общей терапии        |  5 | Н-1  |              2 |
-- |  1 | Отделение общей терапии        |  6 | Н-2  |              2 |
-- |  1 | Отделение общей терапии        |  7 | Н-3  |              2 |
-- |  1 | Отделение общей терапии        |  8 | Н-4  |              2 |
-- |  1 | Отделение общей терапии        |  9 | Н-5  |              2 |
-- ....................................................................
-- |  7 | Физиотерапевтическое отделение | 40 | Т-9  |              6 |
-- |  7 | Физиотерапевтическое отделение | 41 | ФТ-1 |              7 |
-- |  7 | Физиотерапевтическое отделение | 42 | ФТ-2 |              7 |
-- |  7 | Физиотерапевтическое отделение | 43 | ФТ-3 |              7 |
-- |  7 | Физиотерапевтическое отделение | 44 | ФТ-4 |              7 |
-- |  7 | Физиотерапевтическое отделение | 45 | ФТ-5 |              7 |
-- |  7 | Физиотерапевтическое отделение | 46 | ФТ-6 |              7 |
-- |  7 | Физиотерапевтическое отделение | 47 | ФТ-7 |              7 |
-- |  7 | Физиотерапевтическое отделение | 48 | ФТ-8 |              7 |
-- |  7 | Физиотерапевтическое отделение | 49 | ФТ-9 |              7 |
-- +----+--------------------------------+----+------+----------------+
-- 343 rows in set (0.0018 sec)


  select *
    from departments
    join wards
      on departments.id = departments_id
order by departments.id, 
         wards.id;

-- +----+--------------------------------+----+------+----------------+
-- | id | department                     | id | ward | departments_id |
-- +----+--------------------------------+----+------+----------------+
-- |  1 | Отделение общей терапии        |  1 | ОТ-1 |              1 |
-- |  1 | Отделение общей терапии        |  2 | ОТ-2 |              1 |
-- ....................................................................
-- |  7 | Физиотерапевтическое отделение | 48 | ФТ-8 |              7 |
-- |  7 | Физиотерапевтическое отделение | 49 | ФТ-9 |              7 |
-- +----+--------------------------------+----+------+----------------+
-- 49 rows in set (0.0013 sec)


  select department,
         ward
    from departments as d
    join wards as w
      on d.id = departments_id
order by d.id, 
         w.id;

-- +--------------------------------+------+
-- | department                     | ward |
-- +--------------------------------+------+
-- | Отделение общей терапии        | ОТ-1 |
-- | Отделение общей терапии        | ОТ-2 |
-- .........................................
-- | Физиотерапевтическое отделение | ФТ-8 |
-- | Физиотерапевтическое отделение | ФТ-9 |
-- +--------------------------------+------+
-- 49 rows in set (0.0059 sec)


  select concat('\"', department, '\"') as 'department',
         ward
    from departments as d
    join wards as w
      on d.id = departments_id
order by d.id, 
         w.id;

-- +----------------------------------+------+
-- | department                       | ward |
-- +----------------------------------+------+
-- | "Отделение общей терапии"        | ОТ-1 |
-- | "Отделение общей терапии"        | ОТ-2 |
-- ...........................................
-- | "Физиотерапевтическое отделение" | ФТ-8 |
-- | "Физиотерапевтическое отделение" | ФТ-9 |
-- +----------------------------------+------+
-- 49 rows in set (0.0019 sec)


  select department,
         group_concat(ward separator ', ') as 'wards'
    from departments as d
    join wards as w
      on d.id = departments_id
group by department
order by d.id;

-- +--------------------------------------+------------------------------------------------------+
-- | department                           | wards                                                |
-- +--------------------------------------+------------------------------------------------------+
-- | Отделение общей терапии              | ОТ-1, ОТ-2, ОТ-3, ОТ-4                               |
-- | Неврологическое отделение            | Н-1, Н-2, Н-3, Н-4, Н-5, Н-6, Н-7, Н-8               |
-- | Кардиологическое отделение           | К-1, К-2, К-3, К-4, К-5, К-6, К-7, К-8, К-9          |
-- | Отделение функциональной диагностики | ФД-1, ФД-2, ФД-3, ФД-4, ФД-5                         |
-- | Реанимация и интенсивная терапия     | Р-1, Р-2, Р-3, Р-4, Р-5                              |
-- | Токсикологическое отделение          | Т-1, Т-2, Т-3, Т-4, Т-5, Т-6, Т-7, Т-8, Т-9          |
-- | Физиотерапевтическое отделение       | ФТ-1, ФТ-2, ФТ-3, ФТ-4, ФТ-5, ФТ-6, ФТ-7, ФТ-8, ФТ-9 |
-- +--------------------------------------+------------------------------------------------------+
-- 7 rows in set (0.0031 sec)


