from datetime import date
from re import compile


pat_date = compile(
    r'(?P<day>0[1-9]|[12]\d|3[01])'
    r'\.'
    r'(?P<month>0[1-9]|1[012])'
    r'\.'
    r'(?P<year>\d{3,4})'
)

text = '''источник Описывает период с 21.07.1943 по 21.07.1943 г. Сведения. № документа: 2444, Дата создания документа: 21.07.1943 г Архив: ЦАМО, Фонд: 203, Опись: 2843, Дело: 430, Лист начала документа в деле: 13 Авторы документа: ВорФ, подполковник Берлин, майор Вишняков Описывает боевую операцию: Оборонительный период битвы под Курском. 5.7-23.7.43 г.'''

results = pat_date.findall(text)

# >>> results
# [('21', '07', '1943'), ('21', '07', '1943'), ('21', '07', '1943')]

dates = [
    date(*map(int, d[::-1]))
    for d in results
]

# >>> dates
# [datetime.date(1943, 7, 21), datetime.date(1943, 7, 21), datetime.date(1943, 7, 21)]
